In [1]:
import pandas as pd
import numpy as np

In [8]:
df1 = pd.DataFrame(np.arange(8).reshape(2,4), 
                   index=pd.Index(['AC','LC'],name='Team'),
                  columns=pd.Index(['DE','RF','WC','DO'],name='Clasification'))
df1

Clasification  DE  RF  WC  DO
Team
AC              0   1   2   3
LC              4   5   6   7

In [10]:
df1_st = df1.stack()
df1_st

Team  Clasification
AC    DE               0
      RF               1
      WC               2
      DO               3
LC    DE               4
      RF               5
      WC               6
      DO               7
dtype: int64

In [11]:
df1_st.unstack()

Clasification  DE  RF  WC  DO
Team
AC              0   1   2   3
LC              4   5   6   7

In [12]:
df1_st.unstack('Clasification') #unstack by column Clasification

Clasification  DE  RF  WC  DO
Team
AC              0   1   2   3
LC              4   5   6   7

In [14]:
df1_st.unstack('Team')  #unstack by column Team

Team           AC  LC
Clasification
DE              0   4
RF              1   5
WC              2   6
DO              3   7

In [22]:
ser1 = pd.Series([0,1,2], index=['a','b','c'])
ser2 = pd.Series([4,5,6], index=['a','b','c'])

In [31]:
df2 = pd.DataFrame({'A':ser1,'B':ser2})
df2

   A  B
a  0  4
b  1  5
c  2  6

In [35]:
df2.stack()

a  A    0
   B    4
b  A    1
   B    5
c  A    2
   B    6
dtype: int64

In [36]:
df2.unstack()

A  a    0
   b    1
   c    2
B  a    4
   b    5
   c    6
dtype: int64

In [37]:
df2.stack().unstack()

   A  B
a  0  4
b  1  5
c  2  6